-- Переименовать название файла. Вместо "x" - номер группы. Фамилию указать латиницей. (shift + ctrl + S -> сохранить как)
-- Все решения должны быть оформлены в виде запросов, и записаны в этот текстовый файл (в том числе создание хранимых процедур, функций и т.д.).
-- Задания рекомендуется выполнять по порядку.  
-- Задания **{} - выполнять по желанию.

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№1 Создать базу данных.
Открыть SQL скрипты
в папках "один insert на одну запись" и "один insert на все записи" находятся одни и те же записи, разница лишь в количестве insert. 
Многоуровневый insert (все записи в одном) выполняется значительно быстрее.  

В названии файла Insert###, где ### название таблицы.
Создать необходимые таблицы, названия и порядок полей взять в первой строке SQL скрипта, название таблицы из его названия. 
Выполнить запросы для заполнения таблиц

 */

-- Решение (только создания БД и таблиц):

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№2 Найти книги, которым в соответствие ставится только одна тема. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№3 Найти все книги автора – Толстой Лев Николаевич. Учесть все возможные комбинации имени. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№4 Найти самую дорогую книгу или книги.
-- Решение №1 (только одну самую дорогую книгу):

-- Решение №2 (Все самые дорогие книги):

-- Решение №3 (одну самую дорогую книгу, которая стоит больше, чем все остальные. Если такой книги нет – вывести null):

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№5 Найти тему, в которой было выпущено больше всего книг. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№6 Для каждого автора вывести все жанры, в которых он публиковался, объединить все значения жанров в одину ячейку для каждого автора. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	** {Найти все разные почтовые домены (например: gmail.com, mail.ru и т.д.)} */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	** {Найти количество пользователей по каждому почтовому домену} */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/*  ** {Найти самый часто встречающийся почтовый домен} */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№7 Найти аторов у которых  только одна книга. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№8 Найти самого покупаемого автора.

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------

/* 	№9 Найти первую книгу приобретенную читателем. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	** {Найти самую покупаемую книгу для каждого автора} */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№10 Вывести статистику: количество купленных книг по каждому дню. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	№11 Вывести статистику: количество купленных разных книг по каждому дню. */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
/* 	** {Вывести среднее количество (одно число, порядок: до одного знака после запятой) приобретенных книг для всех пользователей которые совершали покупки} */

-- Решение:

-- ----------------------------------------------------------------------------------------------------------------------------------------
